<?php

/**
 * This file is part of CodeIgniter 4 framework.
 *
 * (c) CodeIgniter Foundation <admin@codeigniter.com>
 *
 * For the full copyright and license information, please view
 * the LICENSE file that was distributed with this source code.
 */

// Validation language settings
return [
    // Core Messages
    'noRuleSets'      => 'যাচাইকরণ কনফিগারেশনে কোনো নিয়ম সেট নির্দিষ্ট করা হয়নি।',
    'ruleNotFound'    => '"{0}" একটি বৈধ নিয়ম নয়।',
    'groupNotFound'   => '"{0}" একটি যাচাইকরণ নিয়ম গোষ্ঠী নয়।',
    'groupNotArray'   => '"{0}" নিয়ম গোষ্ঠী একটি অ্যারে হতে হবে।',
    'invalidTemplate' => '"{0}" একটি বৈধ যাচাইকরণ টেমপ্লেট নয়।',

    // Rule Messages
    'alpha'                 => '{field} ক্ষেত্রটি শুধুমাত্র বর্ণানুক্রমিক অক্ষর ধারণ করতে পারে।',
    'alpha_dash'            => '{field} ক্ষেত্রটি শুধুমাত্র বর্ণানুক্রমিক, আন্ডারস্কোর, এবং ড্যাশ অক্ষর ধারণ করতে পারে।',
    'alpha_numeric'         => '{field} ক্ষেত্রটি শুধুমাত্র বর্ণানুক্রমিক অক্ষর ধারণ করতে পারে।',
    'alpha_numeric_punct'   => '{field} ক্ষেত্রটি শুধুমাত্র বর্ণানুক্রমিক অক্ষর, ফাঁকা স্থান, এবং ~ ! # $ % & * - _ + = | : . অক্ষর ধারণ করতে পারে।',
    'alpha_numeric_space'   => '{field} ক্ষেত্রটি শুধুমাত্র বর্ণানুক্রমিক এবং ফাঁকা স্থান অক্ষর ধারণ করতে পারে।',
    'alpha_space'           => '{field} ক্ষেত্রটি শুধুমাত্র বর্ণানুক্রমিক অক্ষর এবং ফাঁকা স্থান ধারণ করতে পারে।',
    'decimal'               => '{field} ক্ষেত্রটি একটি দশমিক সংখ্যা ধারণ করতে হবে।',
    'differs'               => '{field} ক্ষেত্রটি {param} ক্ষেত্র থেকে ভিন্ন হতে হবে।',
    'equals'                => '{field} ক্ষেত্রটি অবশ্যই সঠিকভাবে {param} এর সমান হতে হবে।',
    'exact_length'          => '{field} ক্ষেত্রটি অবশ্যই সঠিকভাবে {param} অক্ষরের দৈর্ঘ্য হতে হবে।',
    'greater_than'          => '{field} ক্ষেত্রটি {param} এর চেয়ে একটি সংখ্যা ধারণ করতে হবে।',
    'greater_than_equal_to' => '{field} ক্ষেত্রটি {param} এর চেয়ে বড় বা সমান একটি সংখ্যা ধারণ করতে হবে।',
    'hex'                   => '{field} ক্ষেত্রটি শুধুমাত্র হেক্সাডেসিমাল অক্ষর ধারণ করতে পারে।',
    'in_list'               => '{field} ক্ষেত্রটি অবশ্যই নিম্নলিখিতগুলির মধ্যে একটি হতে হবে: {param}।',
    'integer'               => '{field} ক্ষেত্রটি একটি পূর্ণসংখ্যা ধারণ করতে হবে।',
    'is_natural'            => '{field} ক্ষেত্রটি শুধুমাত্র ডিজিট ধারণ করতে হবে।',
    'is_natural_no_zero'    => '{field} ক্ষেত্রটি শুধুমাত্র ডিজিট ধারণ করতে পারে এবং শূন্যের চেয়ে বড় হতে হবে।',
    'is_not_unique'         => '{field} ক্ষেত্রটি ডাটাবেসে পূর্বে বিদ্যমান মান ধারণ করতে হবে।',
    'is_unique'             => '{field} ক্ষেত্রটি একটি অনন্য মান ধারণ করতে হবে।',
    'less_than'             => '{field} ক্ষেত্রটি {param} এর চেয়ে একটি ছোট সংখ্যা ধারণ করতে হবে।',
    'less_than_equal_to'    => '{field} ক্ষেত্রটি {param} এর চেয়ে ছোট বা সমান একটি সংখ্যা ধারণ করতে হবে।',
    'matches'               => '{field} ক্ষেত্রটি {param} ক্ষেত্রের সাথে মেলে না।',
    'max_length'            => '{field} ক্ষেত্রটি {param} অক্ষরের দৈর্ঘ্য অতিক্রম করতে পারবে না।',
    'min_length'            => '{field} ক্ষেত্রটি কমপক্ষে {param} অক্ষরের দৈর্ঘ্য হতে হবে।',
    'not_equals'            => '{field} ক্ষেত্রটি: {param} হতে পারবে না।',
    'not_in_list'           => '{field} ক্ষেত্রটি নিম্নলিখিতগুলির মধ্যে একটি হতে পারবে না: {param}।',
    'numeric'               => '{field} ক্ষেত্রটি শুধুমাত্র সংখ্যা ধারণ করতে হবে।',
    'regex_match'           => '{field} ক্ষেত্রটি সঠিক ফরম্যাটে নেই।',
    'required'              => '{field} ক্ষেত্রটি প্রয়োজন।',
    'required_with'         => '{field} ক্ষেত্রটি {param} উপস্থিত থাকলে প্রয়োজন।',
    'required_without'      => '{field} ক্ষেত্রটি {param} উপস্থিত না থাকলে প্রয়োজন।',
    'string'                => '{field} ক্ষেত্রটি একটি বৈধ স্ট্রিং হতে হবে।',
    'timezone'              => '{field} ক্ষেত্রটি একটি বৈধ টাইমজোন হতে হবে।',
    'valid_base64'          => '{field} ক্ষেত্রটি একটি বৈধ বেস64 স্ট্রিং হতে হবে।',
    'valid_email'           => '{field} ক্ষেত্রটি একটি বৈধ ইমেইল ঠিকানা ধারণ করতে হবে।',
    'valid_emails'          => '{field} ক্ষেত্রটি সকল বৈধ ইমেইল ঠিকানা ধারণ করতে হবে।',
    'valid_ip'              => '{field} ক্ষেত্রটি একটি বৈধ আইপি ধারণ করতে হবে।',
    'valid_url'             => '{field} ক্ষেত্রটি একটি বৈধ URL ধারণ করতে হবে।',
    'valid_url_strict'      => '{field} ক্ষেত্রটি একটি বৈধ URL ধারণ করতে হবে।',
    'valid_date'            => '{field} ক্ষেত্রটি একটি বৈধ তারিখ ধারণ করতে হবে।',
    'valid_json'            => '{field} ক্ষেত্রটি একটি বৈধ json ধারণ করতে হবে।',

    // Credit Cards
    'valid_cc_num' => '{field} একটি বৈধ ক্রেডিট কার্ড নম্বর বলে মনে হচ্ছে না।',

    // Files
    'uploaded' => '{field} একটি বৈধ আপলোড করা ফাইল নয়।',
    'max_size' => '{field} ফাইলটি খুব বড়।',
    'is_image' => '{field} একটি বৈধ, আপলোড করা ইমেজ ফাইল নয়।',
    'mime_in'  => '{field} এর একটি বৈধ মাইম টাইপ নেই।',
    'ext_in'   => '{field} এর একটি বৈধ ফাইল এক্সটেনশন নেই।',
    'max_dims' => '{field} হয়তো একটি ছবি নয়, বা এটি খুব বেশি প্রশস্ত বা লম্বা।',
];
