<?php

declare(strict_types=1);

/**
 * This file is part of CodeIgniter Shield.
 *
 * (c) CodeIgniter Foundation <admin@codeigniter.com>
 *
 * For the full copyright and license information, please view
 * the LICENSE file that was distributed with this source code.
 */

return [
    // Exceptions
    'unknownAuthenticator'  => '{0} ಮಾನ್ಯವಾದ ಪ್ರಮಾಣೀಕರಣಕಾರಕ ಅಲ್ಲ.',
    'unknownUserProvider'   => 'ಬಳಸಲು ಬಳಕೆದಾರ ಪೂರಕವನ್ನು ನಿರ್ಧರಿಸಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ.',
    'invalidUser'           => 'ನಿರ್ದಿಷ್ಟಗೊಂಡ ಬಳಕೆದಾರರನ್ನು ಪತ್ತೆಹಚ್ಚಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ.',
    'bannedUser'            => 'ನೀವು ಈಗ ಬ್ಯಾನ್ ಮಾಡಿದವರಾಗಿ ಒಳನೋಟ ನೀಡಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ.',
    'logOutBannedUser'      => 'ನೀವು ಬ್ಯಾನ್ ಮಾಡಿದ ಕಾರಣದಿಂದ ನಿಮ್ಮ ಲಾಗ್‌ಔಟ್ ಮಾಡಲಾಗಿದೆ.',
    'badAttempt'            => 'ನೀವು ಲಾಗ್‌ಇನ್ ಮಾಡಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ. ದಯವಿಟ್ಟು ನಿಮ್ಮ ಪ್ರಮಾಣಪತ್ರಗಳನ್ನು ಪರಿಶೀಲಿಸಿ.',
    'noPassword'            => 'ಪಾಸ್ವರ್ಡು ಇಲ್ಲದ ಬಳಕೆದಾರರನ್ನು ಮಾನ್ಯಮಾಡಲು ಸಾಧ್ಯವಿಲ್ಲ.',
    'invalidPassword'       => 'ನೀವು ಲಾಗ್‌ಇನ್ ಮಾಡಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ. ದಯವಿಟ್ಟು ನಿಮ್ಮ ಪಾಸ್ವರ್ಡ್ ಪರಿಶೀಲಿಸಿ.',
    'noToken'               => '{0} ಹೆಡರ್‌ನಲ್ಲಿ ಪ್ರತಿಯೊಂದು ವಿನಂತಿಯೂ ಒಬ್ಬರ ಟೋಕೆನ್ ಅನ್ನು ಹೊಂದಿರಬೇಕು.',
    'badToken'              => 'ಪ್ರವೇಶ ಟೋಕೆನ್ ಅಮಾನ್ಯವಾಗಿದೆ.',
    'oldToken'              => 'ಪ್ರವೇಶ ಟೋಕೆನ್ காலಾವಧಿಯು ಮುಗಿಯಾಗಿದೆ.',
    'noUserEntity'          => 'ಪಾಸ್ವರ್ಡ್ ಮಾನ್ಯಮಾಡಲು ಬಳಕೆದಾರ ಎಂಟಿಟಿ ಒದಗಿಸಬೇಕಾಗಿದೆ.',
    'invalidEmail'          => 'ಇಮೇಲ್ ವಿಳಾಸವು ದಾಖಲೆಯಲ್ಲಿನ ಇಮೇಲ್ ಅನ್ನು ಹೊಂದಿಸುವುದಿಲ್ಲ ಎಂದು ಪರಿಶೀಲಿಸಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ.',
    'unableSendEmailToUser' => 'ಕ್ಷಮಿಸಿರಿ, ಇಮೇಲ್ ಕಳುಹಿಸುವಾಗ ಸಮಸ್ಯೆಯಾಗಿದೆ. "{0}" ಗೆ ಇಮೇಲ್ ಕಳುಹಿಸಲು ಸಾಧ್ಯವಾಗಿಲ್ಲ.',
    'throttled'             => 'ಈ ಐಪಿ ವಿಳಾಸದಿಂದ ಹೆಚ್ಚು ಹೆಚ್ಚಿನ ವಿನಂತಿಗಳನ್ನು ಮಾಡಲಾಗಿದೆ. ನೀವು {0} ಸೆಕೆಂಡುಗಳಲ್ಲಿ ಮರು ಪ್ರಯತ್ನಿಸಬಹುದು.',
    'notEnoughPrivilege'    => 'ನೀವು ಬೇಕಾದ ಕಾರ್ಯವನ್ನು ನಿರ್ವಹಿಸಲು ಅಗತ್ಯವಾದ ಅನುಮತಿ ಹೊಂದಿಲ್ಲ.',
    // JWT Exceptions
    'invalidJWT'     => 'ಟೋಕೆನ್ ಅಮಾನ್ಯವಾಗಿದೆ.',
    'expiredJWT'     => 'ಟೋಕೆನ್ ಮಿತಿಯು ಮುಗಿಯಾಗಿದೆ.',
    'beforeValidJWT' => 'ಟೋಕೆನ್ ಇನ್ನೂ ಲಭ್ಯವಿಲ್ಲ.',

    'email'           => 'ಇಮೇಲ್ ವಿಳಾಸ',
    'username'        => 'ಬಳಕೆದಾರ ಹೆಸರು',
    'password'        => 'ಪಾಸ್ವರ್ಡ್',
    'passwordConfirm' => 'ಪಾಸ್ವರ್ಡ್ (ಮರು)',
    'haveAccount'     => 'ಇಲ್ಲಿಯೇ ಖಾತೆ ಹೊಂದಿದ್ದೀರಾ?',
    'token'           => 'ಟೋಕೆನ್',

    // Buttons
    'confirm' => 'ಈಗೊ',
    'send'    => 'ಕಳುಹಿಸಿ',

    // Registration
    'register'         => 'ನೋಂದಣಿ',
    'registerDisabled' => 'ನೋಂದಣಿ ಪ್ರಸ್ತುತ ಅನುಮತಿಸದಂತಿದೆ.',
    'registerSuccess'  => 'ಸ್ವಾಗತ!',

    // Login
    'login'              => 'ಲಾಗಿನ್',
    'needAccount'        => 'ಖಾತೆ ಬೇಕೇ?',
    'rememberMe'         => 'ನನ್ನನ್ನು ನೆನಪಿಡಿ?',
    'forgotPassword'     => 'ನಿಮ್ಮ ಪಾಸ್ವರ್ಡ್ ಮರೆತಿದ್ದೀರಾ?',
    'useMagicLink'       => 'ಲಾಗಿನ್ ಲಿಂಕ್ ಬಳಸಿ',
    'magicLinkSubject'   => 'ನಿಮ್ಮ ಲಾಗಿನ್ ಲಿಂಕ್',
    'magicTokenNotFound' => 'ಲಿಂಕ್ ಅನ್ನು ಮಾನ್ಯಮಾಡಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ.',
    'magicLinkExpired'   => 'ಕ್ಷಮಿಸಿರಿ, ಲಿಂಕ್ ಅವಧಿ ಮುಗಿಯಿತು.',
    'checkYourEmail'     => 'ನಿಮ್ಮ ಇಮೇಲ್ ಪರಿಶೀಲಿಸಿ!',
    'magicLinkDetails'   => 'ನಾವು ನಿಮ್ಮ ಇಮೇಲ್ ಗೆ ಲಾಗಿನ್ ಲಿಂಕ್‌ ಅನ್ನು ಕಳುಹಿಸಿದ್ದೇವೆ. ಇದು {0} ನಿಮಿಷಗಳಿಗೆ ಮಾತ್ರ ಮಾನ್ಯವಾಗಿದೆ.',
    'magicLinkDisabled'  => 'ಮ್ಯಾಜಿಕ್‌ ಲಿಂಕ್ ಬಳಸುವದು ಪ್ರಸ್ತುತ ಅನುಮತಿಸಲಾಗುವುದಿಲ್ಲ.',
    'successLogout'      => 'ನೀವು ಯಶಸ್ವಿಯಾಗಿ ಲಾಗ್‌ಔಟ್ ಆಗಿದ್ದೀರಿ.',
    'backToLogin'        => 'ಲಾಗಿನ್‌ಗೆ ಹಿಂದಿರುಗಿ',

    // Passwords
    'errorPasswordLength'       => 'ಪಾಸ್ವರ್ಡು ಕನಿಷ್ಠ {0, number} ಅಕ್ಷರಗಳು երկարಿಯಬೇಕು.',
    'suggestPasswordLength'     => 'ಪಾಸ್‌ಫ್ರೆಜ್‌ಗಳು - 255 ಅಕ್ಷರಗಳಿಗೆ ಉದ್ದ - ಹೆಚ್ಚು ಸುರಕ್ಷಿತ ಪಾಸ್ವರ್ಡ್‌ಗಳನ್ನು ತಯಾರಿಸುತ್ತವೆ ಮತ್ತು ನೆನಪಿಡಲು ಸುಲಭ.',
    'errorPasswordCommon'       => 'ಪಾಸ್ವರ್ಡ್ ಸಾಮಾನ್ಯ ಪಾಸ್ವರ್ಡ್ ಆಗಿರಬಾರದು.',
    'suggestPasswordCommon'     => 'ಪಾಸ್ವರ್ಡ್ 65k ನಷ್ಟು ಸಾಮಾನ್ಯವಾಗಿ ಬಳಸುವ ಪಾಸ್ವರ್ಡ್‌ಗಳನ್ನು ಅಥವಾ ಹ್ಯಾಕ್‌ಗಳು ಮೂಲಕ ಲೀಕ್‌ ಆಗಿರುವ ಪಾಸ್ವರ್ಡ್‌ಗಳನ್ನು ತಲೆ ಹಾಕಲಾಗಿದೆ.',
    'errorPasswordPersonal'     => 'ಪಾಸ್ವರ್ಡ್‌ಗಳನ್ನು ಪುನಃ ಹ್ಯಾಶ್ಡ್ ವೈಯಕ್ತಿಕ ಮಾಹಿತಿಯೊಂದಿಗೆ ಹೊಂದಿರಬಾರದು.',
    'suggestPasswordPersonal'   => 'ನಿಮ್ಮ ಇಮೇಲ್ ವಿಳಾಸ ಅಥವಾ ಬಳಕೆದಾರ ಹೆಸರಿನ ವಿಭಿನ್ನ ರೂಪಗಳನ್ನು ಪಾಸ್ವರ್ಡ್‌ಗಳಲ್ಲಿ ಬಳಸಬೇಡಿ.',
    'errorPasswordTooSimilar'   => 'ಪಾಸ್ವರ್ಡ್ ಬಳಕೆದಾರ ಹೆಸರಿನಂತೆ ಹೆಚ್ಚು ಹೋಲಿಸುತ್ತದೆ.',
    'suggestPasswordTooSimilar' => 'ನಿಮ್ಮ ಬಳಕೆದಾರ ಹೆಸರಿನ ಭಾಗಗಳನ್ನು ಪಾಸ್ವರ್ಡ್‌ನಲ್ಲಿ ಬಳಸಬೇಡಿ.',
    'errorPasswordPwned'        => 'ಪಾಸ್ವರ್ಡ್ {0} ಡೇಟಾ ಉದ್ದರಣೆ ಕಾರಣದಿಂದ ಬಹಿರಂಗವಾಗಿದೆ ಮತ್ತು {1, number} ಬಾರಿ {2} ಪಾಸ್ವರ್ಡ್‌ಗಳಲ್ಲಿ ಕಂಡುಬಂದಿದೆ.',
    'suggestPasswordPwned'      => '{0} ಅನ್ನು ಪಾಸ್ವರ್ಡ್‌ म्हणून ಬಳಸಬಾರದು. ನೀವು ಇದನ್ನು ಎಲ್ಲಿಯೂ ಬಳಸುತ್ತಿದ್ದರೆ ತಕ್ಷಣ ಬದಲಾಯಿಸಿ.',
    'errorPasswordEmpty'        => 'ಪಾಸ್ವರ್ಡ್ ಅಗತ್ಯವಿದೆ.',
    'errorPasswordTooLongBytes' => 'ಪಾಸ್ವರ್ಡ್ {param} ಬೈಟುಗಳ ಉದ್ದವನ್ನು ಮೀರಿಸಬಾರದು.',
    'passwordChangeSuccess'     => 'ಪಾಸ್ವರ್ಡ್ ಯಶಸ್ವಿಯಾಗಿ ಬದಲಾಯಿಸಲಾಗಿದೆ',
    'userDoesNotExist'          => 'ಪಾಸ್ವರ್ಡ್ ಬದಲಾಯಿಸಲಾಯಿತು. ಬಳಕೆದಾರನು ಇಲ್ಲ',
    'resetTokenExpired'         => 'ಕ್ಷಮಿಸಿರಿ. ನಿಮ್ಮ ಪುನಸ್ಸೆಟ್ ಟೋಕೆನ್ ಕಾಲಾವಧಿಯು ಮುಗಿಯಿತು.',

    // Email Globals
    'emailInfo'      => 'ನಿಮ್ಮ ಬಗ್ಗೆ ಕೆಲವು ಮಾಹಿತಿಗಳು:',
    'emailIpAddress' => 'ಐಪಿ ವಿಳಾಸ:',
    'emailDevice'    => 'ಹಣಕಾಸು:',
    'emailDate'      => 'ದಿನಾಂಕ:',

    // 2FA
    'email2FATitle'       => 'ಎರಡನೇ ಅಂಶದ ಪ್ರಮಾಣೀಕರಣ',
    'confirmEmailAddress' => 'ನಿಮ್ಮ ಇಮೇಲ್ ವಿಳಾಸವನ್ನು ದೃಢೀಕರಿಸಿ.',
    'emailEnterCode'      => 'ನಿಮ್ಮ ಇಮೇಲ್ ಅನ್ನು ದೃಢೀಕರಿಸಿ',
    'emailConfirmCode'    => 'ನಿಮ್ಮ ಇಮೇಲ್ ವಿಳಾಸಕ್ಕೆ ಕಳುಹಿಸಿದ 6-ಅಂಕಿಯ ಕೋಡ್ ಅನ್ನು ನಮೂದಿಸಿ.',
    'email2FASubject'     => 'ನಿಮ್ಮ ಪ್ರಮಾಣೀಕರಣ ಕೋಡ್',
    'email2FAMailBody'    => 'ನಿಮ್ಮ ಪ್ರಮಾಣೀಕರಣ ಕೋಡ್ ಇವು:',
    'invalid2FAToken'     => 'ಕೋಡ್ ತಪ್ಪಾಗಿದೆ.',
    'need2FA'             => 'ನೀವು ಎರಡು ಅಂಶದ ಪರಿಶೀಲನೆಯನ್ನು ಪೂರ್ಣಗೊಳಿಸಬೇಕು.',
    'needVerification'    => 'ಖಾತೆ ಸಕ್ರಿಯಗೊಳಿಸಲು ನಿಮ್ಮ ಇಮೇಲ್ ಅನ್ನು ಪರಿಶೀಲಿಸಿ.',

    // Activate
    'emailActivateTitle'    => 'ಇಮೇಲ್ ಸಕ್ರಿಯಕರಣ',
    'emailActivateBody'     => 'ನಿಮ್ಮ ಇಮೇಲ್ ವಿಳಾಸವನ್ನು ದೃಢೀಕರಿಸಲು ಕೋಡ್‌ ಅನ್ನು ಕಳುಹಿಸಿದ್ದೇವೆ. ಆ ಕೋಡ್ ಅನ್ನು ಕಾಪಿ ಮಾಡಿ ಕೆಳಗಿನಿಗೆ ಹಾಕಿ.',
    'emailActivateSubject'  => 'ನಿಮ್ಮ ಸಕ್ರಿಯಕರಣ ಕೋಡ್',
    'emailActivateMailBody' => 'ನಿಮ್ಮ ಖಾತೆ ಸಕ್ರಿಯಗೊಳಿಸಲು ಮತ್ತು साइट ಬಳಸಲು ಕೋಡ್ ಅನ್ನು ಬಳಸಿರಿ.',
    'invalidActivateToken'  => 'ಕೋಡ್ ತಪ್ಪಾಗಿದೆ.',
    'needActivate'          => 'ನಿಮ್ಮ ಇಮೇಲ್ ವಿಳಾಸಕ್ಕೆ ಕಳುಹಿಸಿದ ಕೋಡ್ ಅನ್ನು ದೃಢೀಕರಿಸುವ ಮೂಲಕ ನಿಮ್ಮ ನೋಂದಣಿಯನ್ನು ಪೂರ್ಣಗೊಳಿಸಬೇಕು.',
    'activationBlocked'     => 'ಲಾಗಿನ್ ಮಾಡುವ ಮೊದಲು ನಿಮ್ಮ ಖಾತೆಯನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಬೇಕು.',

    // Groups
    'unknownGroup' => '{0} ಮಾನ್ಯವಾದ ಗುಂಪು ಅಲ್ಲ.',
    'missingTitle' => 'ಗುಂಪುಗಳಿಗೆ ಶೀರ್ಷಿಕೆ ಇರಬೇಕಾಗಿದೆ.',

    // Permissions
    'unknownPermission' => '{0} ಮಾನ್ಯವಾದ ಅನುಮತಿ ಅಲ್ಲ.',
];
