<?php

/**
 * This file is part of CodeIgniter 4 framework.
 *
 * (c) CodeIgniter Foundation <admin@codeigniter.com>
 *
 * For the full copyright and license information, please view
 * the LICENSE file that was distributed with this source code.
 */

// Validation language settings
return [
    // Core Messages
    'noRuleSets'      => 'ಮೌಲ್ಯಮಾಪನ ಸಿದ್ಧಾಂತದಲ್ಲಿ ಯಾವುದೇ ನಿಯಮ ಸೆಟುಗಳು निर्दಿಷ್ಟವಾಗಿಲ್ಲ.',
    'ruleNotFound'    => '"{0}" ಪ್ರಮಾಣಿತ ನಿಯಮವಲ್ಲ.',
    'groupNotFound'   => '"{0}" ಸಿದ್ಧಾಂತ ನಿಯಮಗಳ ಗುಂಪು ಅಲ್ಲ.',
    'groupNotArray'   => '"{0}" ನಿಯಮ ಗುಂಪು ಅರೇ ಅನ್ನು ಹೊಂದಿರಬೇಕು.',
    'invalidTemplate' => '"{0}" ಸರಿ ಹೋಲಿಸುವ ಮಾದರಿ ಅಲ್ಲ.',

    // Rule Messages
    'alpha'                 => '{field} ಕ್ಷೇತ್ರವು ಕೇವಲ ಅಕ್ಷರೀಯ ಅಕ್ಷರಗಳನ್ನು ಮಾತ್ರ ಒಳಗೊಂಡಿರಬಹುದು.',
    'alpha_dash'            => '{field} ಕ್ಷೇತ್ರವು ಕೇವಲ ಅಕ್ಷರೀಯ, ಅಂಕೆ, ಅಡಚಣೆ ಮತ್ತು ಡ್ಯಾಶ್ ಅಕ್ಷರಗಳನ್ನು ಮಾತ್ರ ಒಳಗೊಂಡಿರಬಹುದು.',
    'alpha_numeric'         => '{field} ಕ್ಷೇತ್ರವು ಕೇವಲ ಅಕ್ಷರೀಯ ಅಕ್ಷರಗಳು ಮತ್ತು ಸಂಖ್ಯೆಗಳು ಮಾತ್ರ ಒಳಗೊಂಡಿರಬಹುದು.',
    'alpha_numeric_punct'   => '{field} ಕ್ಷೇತ್ರವು ಕೇವಲ ಅಕ್ಷರೀಯ ಅಕ್ಷರಗಳು, ಖಾಲಿ, ಮತ್ತು ~ ! # $ % & * - _ + = | : . ಅಕ್ಷರಗಳನ್ನು ಒಳಗೊಂಡಿರಬಹುದು.',
    'alpha_numeric_space'   => '{field} ಕ್ಷೇತ್ರವು ಕೇವಲ ಅಕ್ಷರೀಯ ಅಕ್ಷರಗಳು ಮತ್ತು ಖಾಲಿ ಅಕ್ಷರಗಳನ್ನು ಮಾತ್ರ ಒಳಗೊಂಡಿರಬಹುದು.',
    'alpha_space'           => '{field} ಕ್ಷೇತ್ರವು ಕೇವಲ ಅಕ್ಷರೀಯ ಅಕ್ಷರಗಳು ಮತ್ತು ಖಾಲಿ ಅಕ್ಷರಗಳನ್ನು ಮಾತ್ರ ಒಳಗೊಂಡಿರಬಹುದು.',
    'decimal'               => '{field} ಕ್ಷೇತ್ರವು ದಶಮಾಂಶ ಸಂಖ್ಯೆಯನ್ನು ಒಳಗೊಂಡಿರಬೇಕು.',
    'differs'               => '{field} ಕ್ಷೇತ್ರವು {param} ಕ್ಷೇತ್ರದಿಂದ ವಿಭಿನ್ನವಾಗಿರಬೇಕು.',
    'equals'                => '{field} ಕ್ಷೇತ್ರವು ಖಚಿತವಾಗಿ: {param} ಇರಬೇಕು.',
    'exact_length'          => '{field} ಕ್ಷೇತ್ರವು ಖಚಿತವಾಗಿ {param} ಅಕ್ಷರಗಳ ಉದ್ದವನ್ನು ಹೊಂದಿರಬೇಕು.',
    'greater_than'          => '{field} ಕ್ಷೇತ್ರವು {param} ಕ್ಕಿಂತ ದೊಡ್ಡ ಸಂಖ್ಯೆಯನ್ನು ಒಳಗೊಂಡಿರಬೇಕು.',
    'greater_than_equal_to' => '{field} ಕ್ಷೇತ್ರವು {param} ಕ್ಕಿಂತ ದೊಡ್ಡ ಅಥವಾ ಸಮಾನ ಸಂಖ್ಯೆಯನ್ನು ಒಳಗೊಂಡಿರಬೇಕು.',
    'hex'                   => '{field} ಕ್ಷೇತ್ರವು ಕೇವಲ ಹೆಕ್ಸಾ ಡೆಸಿಮಲ್ ಅಕ್ಷರಗಳನ್ನು ಮಾತ್ರ ಹೊಂದಿರಬಹುದು.',
    'in_list'               => '{field} ಕ್ಷೇತ್ರವು ಒಂದಾದ ಒಂದು ಇರಬೇಕು: {param}.',
    'integer'               => '{field} ಕ್ಷೇತ್ರವು ಪೂರ್ಣಾಂಕವನ್ನು ಮಾತ್ರ ಹೊಂದಿರಬೇಕು.',
    'is_natural'            => '{field} ಕ್ಷೇತ್ರವು ಕೇವಲ ಸಂಖ್ಯೆಗಳಲ್ಲಿರಬೇಕು.',
    'is_natural_no_zero'    => '{field} ಕ್ಷೇತ್ರವು ಕೇವಲ ಸಂಖ್ಯೆಗಳಲ್ಲಿರಬೇಕು ಮತ್ತು ಶೂನ್ಯಕ್ಕಿಂತ ದೊಡ್ಡದ್ದಾಗಿರಬೇಕು.',
    'is_not_unique'         => '{field} ಕ್ಷೇತ್ರವು ಡೇಟಾಬೇಸ್ನಲ್ಲಿ ಇತ್ತೀಚೆಗೆ ಇರುವ ಮೌಲ್ಯವನ್ನು ಹೊಂದಿರಬೇಕು.',
    'is_unique'             => '{field} ಕ್ಷೇತ್ರವು ಅನನ್ಯ ಮೌಲ್ಯವನ್ನು ಹೊಂದಿರಬೇಕು.',
    'less_than'             => '{field} ಕ್ಷೇತ್ರವು {param} ಕ್ಕಿಂತ ಕಡಿಮೆ ಸಂಖ್ಯೆಯನ್ನು ಹೊಂದಿರಬೇಕು.',
    'less_than_equal_to'    => '{field} ಕ್ಷೇತ್ರವು {param} ಕ್ಕಿಂತ ಕಡಿಮೆ ಅಥವಾ ಸಮಾನ ಸಂಖ್ಯೆಯನ್ನು ಹೊಂದಿರಬೇಕು.',
    'matches'               => '{field} ಕ್ಷೇತ್ರವು {param} ಕ್ಷೇತ್ರವನ್ನು ಹೊಂದುವುದಿಲ್ಲ.',
    'max_length'            => '{field} ಕ್ಷೇತ್ರವು {param} ಅಕ್ಷರಗಳನ್ನು ಮೀರಿಸದಂತೆ ಇರಬೇಕು.',
    'min_length'            => '{field} ಕ್ಷೇತ್ರವು {param} ಅಕ್ಷರಗಳನ್ನು ಕನಿಷ್ಠ ಉದ್ದವನ್ನು ಹೊಂದಿರಬೇಕು.',
    'not_equals'            => '{field} ಕ್ಷೇತ್ರವು: {param} ಇರಬಾರದು.',
    'not_in_list'           => '{field} ಕ್ಷೇತ್ರವು: {param} ನಲ್ಲಿ ಒಂದೂ ಇರಬಾರದು.',
    'numeric'               => '{field} ಕ್ಷೇತ್ರವು ಕೇವಲ ಸಂಖ್ಯೆಗಳನ್ನೇ ಒಳಗೊಂಡಿರಬೇಕು.',
    'regex_match'           => '{field} ಕ್ಷೇತ್ರವು ಸರಿಯಾದ ಸ್ವರೂಪದಲ್ಲಿಲ್ಲ.',
    'required'              => '{field} ಕ್ಷೇತ್ರವು ಅಗತ್ಯವಿದೆ.',
    'required_with'         => '{field} ಕ್ಷೇತ್ರವು {param} ಇದ್ದಾಗ ಅಗತ್ಯವಿದೆ.',
    'required_without'      => '{field} ಕ್ಷೇತ್ರವು {param} ಇಲ್ಲದಾಗ ಅಗತ್ಯವಿದೆ.',
    'string'                => '{field} ಕ್ಷೇತ್ರವು ಮಾನ್ಯವಾದ ಸ್ಟ್ರಿಂಗ್ ಆಗಿರಬೇಕು.',
    'timezone'              => '{field} ಕ್ಷೇತ್ರವು ಮಾನ್ಯವಾದ ಟೈಮ್‌ಜೋನ್ ಆಗಿರಬೇಕು.',
    'valid_base64'          => '{field} ಕ್ಷೇತ್ರವು ಮಾನ್ಯವಾದ base64 ಸ್ಟ್ರಿಂಗ್ ಆಗಿರಬೇಕು.',
    'valid_email'           => '{field} ಕ್ಷೇತ್ರವು ಮಾನ್ಯವಾದ ಇಮೇಲ್ ವಿಳಾಸವನ್ನು ಒಳಗೊಂಡಿರಬೇಕು.',
    'valid_emails'          => '{field} ಕ್ಷೇತ್ರವು ಎಲ್ಲಾ ಮಾನ್ಯವಾದ ಇಮೇಲ್ ವಿಳಾಸಗಳನ್ನು ಒಳಗೊಂಡಿರಬೇಕು.',
    'valid_ip'              => '{field} ಕ್ಷೇತ್ರವು ಮಾನ್ಯವಾದ ಐಪಿ ವಿಳಾಸವನ್ನು ಒಳಗೊಂಡಿರಬೇಕು.',
    'valid_url'             => '{field} ಕ್ಷೇತ್ರವು ಮಾನ್ಯವಾದ URL ಅನ್ನು ಒಳಗೊಂಡಿರಬೇಕು.',
    'valid_url_strict'      => '{field} ಕ್ಷೇತ್ರವು ಮಾನ್ಯವಾದ URL ಅನ್ನು ಒಳಗೊಂಡಿರಬೇಕು.',
    'valid_date'            => '{field} ಕ್ಷೇತ್ರವು ಮಾನ್ಯವಾದ ದಿನಾಂಕವನ್ನು ಒಳಗೊಂಡಿರಬೇಕು.',
    'valid_json'            => '{field} ಕ್ಷೇತ್ರವು ಮಾನ್ಯವಾದ JSON ಅನ್ನು ಒಳಗೊಂಡಿರಬೇಕು.',

    // Credit Cards
    'valid_cc_num' => '{field} ಮಾನ್ಯವಾದ ಕ್ರೆಡಿಟ್ ಕಾರ್ಡ್ ಸಂಖ್ಯೆಯಂತೆ ಕಾಣುತ್ತಿಲ್ಲ.',

    // Files
    'uploaded' => '{field} ಮಾನ್ಯವಾದ ಅಪ್ಲೋಡ್ ಮಾಡಿದ ಫೈಲ್ ಅಲ್ಲ.',
    'max_size' => '{field} ಹೆಚ್ಚು ದೊಡ್ಡ ಫೈಲ್ ಆಗಿದೆ.',
    'is_image' => '{field} ಮಾನ್ಯವಾದ, ಅಪ್ಲೋಡ್ ಮಾಡಿದ ಚಿತ್ರ ಫೈಲ್ ಅಲ್ಲ.',
    'mime_in'  => '{field} ಮಾನ್ಯವಾದ mime ಪ್ರಕಾರವಿಲ್ಲ.',
    'ext_in'   => '{field} ಮಾನ್ಯವಾದ ಫೈಲ್ ವಿಸ್ತರಣೆ ಇಲ್ಲ.',
    'max_dims' => '{field} ಚಿತ್ರವಲ್ಲ, ಅಥವಾ ಹೆಚ್ಚು ಅಗಲವಾದ ಅಥವಾ ಎತ್ತರದದ್ದಾಗಿದೆ.',
];
