<?php

declare(strict_types=1);

/**
 * This file is part of CodeIgniter Shield.
 *
 * (c) CodeIgniter Foundation <admin@codeigniter.com>
 *
 * For the full copyright and license information, please view
 * the LICENSE file that was distributed with this source code.
 */

return [
    // Exceptions
    'unknownAuthenticator'  => '{0} သည် အတည်ပြုသူ မမှန်ပါ။',
    'unknownUserProvider'   => 'သုံးစွဲသူ ပံ့ပိုးသူကို သတ်မှတ်၍ မရပါ။',
    'invalidUser'           => 'သတ်မှတ်ထားသော သုံးစွဲသူကို ရှာမတွေ့ပါ။',
    'bannedUser'            => 'သင်အား တားမြစ်ထားသောကြောင့် လော့ဂ်အင်ပြုလုပ်၍ မရပါ။',
    'logOutBannedUser'      => 'သင်တားမြစ်ထားသောကြောင့် လော့ဂ်အင်မပြုလုပ်နိုင်ပါ။',
    'badAttempt'            => 'သင့်ကို လော့ဂ်အင်လုပ်၍ မရပါ။ သင့်အချက်အလက်ကို စစ်ဆေးပါ။',
    'noPassword'            => 'စကားဝှက်မရှိဘဲ သုံးစွဲသူကို စစ်ဆေး၍ မရပါ။',
    'invalidPassword'       => 'သင်အား လော့ဂ်အင်မပြုလုပ်နိုင်ပါ။ သင့်စကားဝှက်ကို စစ်ဆေးပါ။',
    'noToken'               => 'တိုက်တွန်းလွှာတွင် {0} ခေါင်းစဥ်ရှိအောင် အားလုံးသော မေးခွန်းများတွင် တိုက်တွန်းလွှာရှိရမည်။',
    'badToken'              => 'သုံးစွဲခွင့် တိုက်တွန်းလွှာ မမှန်ပါ။',
    'oldToken'              => 'သုံးစွဲခွင့် တိုက်တွန်းလွှာ သက်တမ်းကုန်ဆုံးပြီးပါသည်။',
    'noUserEntity'          => 'စကားဝှက်စစ်ဆေးရန် သုံးစွဲသူ အရာဝတ္ထု ပေးရန် လိုအပ်သည်။',
    'invalidEmail'          => 'အီးမေးလ် လိပ်စာကို မှတ်တမ်းမှာရှိသော အီးမေးလ်နှင့် ကိုက်ညီမှုကို စစ်ဆေး၍ မရပါ။',
    'unableSendEmailToUser' => 'နောက်ဆုံးထားပါ၊ အီးမေးလ်ပို့ရန် ပြဿနာတက်နေပါသည်။ "{0}" သို့ အီးမေးလ်ပို့၍ မရပါ။',
    'throttled'             => 'ဤ IP လိပ်စာမှ မေးခွန်းများ များပြားနေပါသည်။ {0} စက္ကန့်အကြာ ထပ်မံလေးစားပါ။',
    'notEnoughPrivilege'    => 'လိုအပ်သော ခွင့်ပြုချက် မရှိပါ။',
    // JWT Exceptions
    'invalidJWT'     => 'တိုက်တွန်းလွှာ မမှန်ပါ။',
    'expiredJWT'     => 'တိုက်တွန်းလွှာ သက်တမ်းကုန်ဆုံးပြီးပါသည်။',
    'beforeValidJWT' => 'တိုက်တွန်းလွှာ သုံးစွဲရန် အဆင်မပြေတာပါ။',

    'email'           => 'အီးမေးလ် လိပ်စာ',
    'username'        => 'အသုံးပြုသူအမည်',
    'password'        => 'စကားဝှက်',
    'passwordConfirm' => 'စကားဝှက် (နောက်တစ်ကြိမ်)',
    'haveAccount'     => 'လက်ရှိတွင် အကောင့်ရှိပါသလား?',
    'token'           => 'တိုက်တွန်းလွှာ',

    // Buttons
    'confirm' => 'အတည်ပြုမည်',
    'send'    => 'ပို့မည်',

    // Registration
    'register'         => 'အကောင့် ဖန်တီးမည်',
    'registerDisabled' => 'လက်ရှိတွင် အကောင့်ဖန်တီးရန် ခွင့်ပြုထားခြင်း မရှိပါ။',
    'registerSuccess'  => 'ကျွန်ုပ်တို့၏အဖွဲ့သို့ ကြိုဆိုပါသည်။',

    // Login
    'login'              => 'လော့ဂ်အင်',
    'needAccount'        => 'အကောင့် လိုအပ်ပါသလား?',
    'rememberMe'         => 'အတည်ပြုမည်လား?',
    'forgotPassword'     => 'စကားဝှက်ကို မေ့နေပါသလား?',
    'useMagicLink'       => 'လော့ဂ်အင်လင့်ခ် အသုံးပြုပါ',
    'magicLinkSubject'   => 'သင့် လော့ဂ်အင် လင့်ခ်',
    'magicTokenNotFound' => 'လင့်ခ်ကို အတည်ပြု၍ မရပါ။',
    'magicLinkExpired'   => 'နောက်ဆုံးထားပါ၊ လင့်ခ် သက်တမ်းကုန်ဆုံးပြီးပါသည်။',
    'checkYourEmail'     => 'သင့်အီးမေးလ်ကို စစ်ဆေးပါ!',
    'magicLinkDetails'   => 'သင်အား လော့ဂ်အင်လင့်ခ်ဖြင့် အီးမေးလ်ပို့ပေးခဲ့ပါသည်။ ယင်းသည် {0} မိနစ်အတွင်းသာ သက်ဝင်ပါသည်။',
    'magicLinkDisabled'  => 'MagicLink အသုံးပြုခြင်း လက်ရှိတွင် ခွင့်ပြုထားခြင်း မရှိပါ။',
    'successLogout'      => 'သင့်အကောင့်မှ အောင်မြင်စွာ လော့ဂ်အောက်ပြုလုပ်ထားပါသည်။',
    'backToLogin'        => 'လော့ဂ်အင်သို့ ပြန်သွားပါ',

    // Passwords
    'errorPasswordLength'       => 'စကားဝှက်များသည် {0, number} အနည်းဆုံး လျှောက်ထားရပါသည်။',
    'suggestPasswordLength'     => 'စကားဝှက်များကို သတိထားရန် အဆင်ပြေသော ပေါ်တည်မှုပုံစံများကို 255 စာလုံးအထိ အသုံးပြုပါ။',
    'errorPasswordCommon'       => 'စကားဝှက်သည် ထင်ရှားသော စကားဝှက် မဖြစ်ရပါ။',
    'suggestPasswordCommon'     => 'စကားဝှက်ကို 65k ကျော်သော ထင်ရှားသော စကားဝှက်များနှင့် ပြန်စစ်ထားပါသည်။',
    'errorPasswordPersonal'     => 'စကားဝှက်တွင် ကိုယ်ပိုင် အချက်အလက်များကို မပါဝင်ပါ။',
    'suggestPasswordPersonal'   => 'သင့်အီးမေးလ်လိပ်စာ သို့မဟုတ် အသုံးပြုသူအမည်ကို စကားဝှက်များအတွက် မသုံးပါနှင့်။',
    'errorPasswordTooSimilar'   => 'စကားဝှက်သည် အသုံးပြုသူအမည်နှင့် နီးစပ်လှပါသည်။',
    'suggestPasswordTooSimilar' => 'သင့်စကားဝှက်တွင် အသုံးပြုသူအမည်၏ အစိတ်အပိုင်းများကို မသုံးပါနှင့်။',
    'errorPasswordPwned'        => '{0} သုံးစွဲသူအမည်သည် ဒေတာပျက်ကွက်မှုကြောင့် ဖွင့်ထားရှိပြီး၊ {1, number} ကြိမ် ကြိုးမပေးပါ။',
    'suggestPasswordPwned'      => '{0} ကို စကားဝှက်အဖြစ် မသုံးပါနှင့်။ သင်သည် ယင်းကို သုံးနေပါက ချက်ချင်း ပြောင်းပါ။',
    'errorPasswordEmpty'        => 'စကားဝှက်လိုအပ်ပါသည်။',
    'errorPasswordTooLongBytes' => 'စကားဝှက်သည် {param} ဘိုက်များထက် မကျော်သင့်ပါ။',
    'passwordChangeSuccess'     => 'စကားဝှက်ပြောင်းလဲမှု အောင်မြင်ပါသည်။',
    'userDoesNotExist'          => 'စကားဝှက်ပြောင်းလဲမှု မပြုလုပ်နိုင်ပါ။ သုံးစွဲသူ မရှိပါ။',
    'resetTokenExpired'         => 'နောက်ဆုံးထားပါ။ သင့်ပြန်လည်ချိန်ညှိတံဆိပ် သက်တမ်းကုန်ဆုံးပြီးပါသည်။',

    // Email Globals
    'emailInfo'      => 'သုံးစွဲသူအကြောင်း အချက်အလက်အချို့:',
    'emailIpAddress' => 'IP လိပ်စာ:',
    'emailDevice'    => 'ကိရိယာ:',
    'emailDate'      => 'ရက်စွဲ:',

    // 2FA
    'email2FATitle'       => 'နှစ်ထပ်အတည်ပြုခြင်း',
    'confirmEmailAddress' => 'သင့်အီးမေးလ်လိပ်စာကို အတည်ပြုပါ။',
    'emailEnterCode'      => 'သင့်အီးမေးလ်ကို အတည်ပြုပါ',
    'emailConfirmCode'    => 'သင့်အီးမေးလ်လိပ်စာသို့ ပို့ခဲ့သော 6-ဓာတ်ကူးကုတ်ကို ရိုက်ထည့်ပါ။',
    'email2FASubject'     => 'သင့်အတည်ပြုကုတ်',
    'email2FAMailBody'    => 'သင့်အတည်ပြုကုတ်မှာ:',
    'invalid2FAToken'     => 'ကုတ်မှားပါသည်။',
    'need2FA'             => 'နှစ်ထပ်အတည်ပြုမှု ပြီးမြောက်ရမည်။',
    'needVerification'    => 'အကောင့်အတည်ပြုရန် အီးမေးလ်ကို စစ်ဆေးပါ။',

    // Activate
    'emailActivateTitle'    => 'အီးမေးလ် တည်ထောင်ခြင်း',
    'emailActivateBody'     => 'သင့်အီးမေးလ်လိပ်စာကို အတည်ပြုရန် ကုတ်ဖြင့် အီးမေးလ်ပို့ပေးခဲ့ပါသည်။ အောက်ပါကုတ်ကို ကူးယူ၍ အောက်တွင် ထည့်ပါ။',
    'emailActivateSubject'  => 'သင့်တည်ထောင်မှုကုတ်',
    'emailActivateMailBody' => 'သင့်အကောင့်ကို ဖွင့်သုံးရန် အောက်ပါကုတ်ကို သုံးပါ။',
    'invalidActivateToken'  => 'ကုတ်မှားပါသည်။',
    'needActivate'          => 'သင့်အီးမေးလ်လိပ်စာသို့ ပို့ခဲ့သော ကုတ်ကို အတည်ပြု၍ သင့်အကောင့်ကို အတည်ပြုရမည်။',
    'activationBlocked'     => 'သင့်အကောင့်ကို လော့ဂ်အင်လုပ်မည်မဟုတ်မီ အတည်ပြုရမည်။',

    // Groups
    'unknownGroup' => '{0} သည် သတ်မှတ်ထားသော အုပ်စု မဖြစ်ပါ။',
    'missingTitle' => 'အုပ်စုများတွင် ခေါင်းစဉ်ရှိရမည်။',

    // Permissions
    'unknownPermission' => '{0} သည် သတ်မှတ်ထားသော ခွင့်ပြုချက် မဖြစ်ပါ။',
];
