<?php

declare(strict_types=1);

/**
 * This file is part of CodeIgniter Shield.
 *
 * (c) CodeIgniter Foundation <admin@codeigniter.com>
 *
 * For the full copyright and license information, please view
 * the LICENSE file that was distributed with this source code.
 */

return [
    // Exceptions
    'unknownAuthenticator'  => '{0} ஒரு செல்லுபடியான அங்கீகாரன் அல்ல.',
    'unknownUserProvider'   => 'ஏதேனும் பயனர் வழங்குபவரைப் பயன்படுத்த முடியவில்லை.',
    'invalidUser'           => 'குறிப்பிட்ட பயனரை கண்டுபிடிக்க முடியவில்லை.',
    'bannedUser'            => 'நீங்கள் தடை செய்யப்பட்டுள்ளதால் உங்களை உள்நுழைக்க முடியாது.',
    'logOutBannedUser'      => 'நீங்கள் தடை செய்யப்பட்டதால் உங்களுக்கு வெளியேறி விட்டனர்.',
    'badAttempt'            => 'உங்களை உள்நுழைக்க முடியவில்லை. உங்கள் சான்றுகளைச் சரிபார்க்கவும்.',
    'noPassword'            => 'ஒரு கடவுச்சொல்லின்றி பயனரை சரிபார்க்க முடியாது.',
    'invalidPassword'       => 'உங்களை உள்நுழைக்க முடியவில்லை. உங்கள் கடவுச்சொல்லைச் சரிபார்க்கவும்.',
    'noToken'               => 'ஒவ்வொரு கோரிக்கைக்கும் {0} தலைப்பில் ஒரு bearer token வேண்டும்.',
    'badToken'              => 'அணுகல் token செல்லுபடியாகவில்லை.',
    'olToken'              => 'அணுகல் token காலாவதியானது.',
    'noUserEntity'          => 'கடவுச்சொல் சரிபார்ப்புக்கு பயனர் Entity வழங்கப்பட வேண்டும்.',
    'invalidEmail'          => 'மின்னஞ்சல் முகவரி பதிவில் உள்ள மின்னஞ்சலை ஒத்திருக்கிறதா என சரிபார்க்க முடியவில்லை.',
    'unableSendEmailToUser' => 'மன்னிக்கவும், மின்னஞ்சல் அனுப்புவதில் ஒரு பிரச்சனை ஏற்பட்டது. "{0}" க்கு மின்னஞ்சலை அனுப்ப முடியவில்லை.',
    'throttled'             => 'இந்த IP முகவரியிலிருந்து அதிகமாக கோரிக்கைகள் செய்யப்பட்டுள்ளன. {0} நொடிகளில் மீண்டும் முயற்சிக்கலாம்.',
    'notEnoughPrivilege'    => 'தேவையான அனுமதிகள் இல்லாமல் நீங்கள் விரும்பும் செயல்பாட்டை மேற்கொள்வதற்கு முடியாது.',
    // JWT Exceptions
    'invalidJWT'     => 'Token செல்லுபடியாகாது.',
    'expiredJWT'     => 'Token காலாவதியாகிவிட்டது.',
    'beforeValidJWT' => 'Token இன்னும் கிடைக்கவில்லை.',
    
    'email'           => 'மின்னஞ்சல் முகவரி',
    'username'        => 'பயனர்பெயர்',
    'password'        => 'கடவுச்சொல்',
    'passwordConfirm' => 'கடவுச்சொல் (மறு)',
    'haveAccount'     => 'மேற்கொண்டு கணக்கொன்று உள்ளதா?',
    'token'           => 'Token',
    
    // Buttons
    'confirm' => 'உறுதிப்படுத்தவும்',
    'send'    => 'அனுப்பவும்',
    
    // Registration
    'register'         => 'பதிவுசெய்க',
    'registerDisabled' => 'பதிவிறக்கம் தற்போது அனுமதிக்கப்படவில்லை.',
    'registerSuccess'  => 'வரவேற்கிறோம்!',
    
    // Login
    'login'              => 'உள்நுழைக',
    'needAccount'        => 'ஒரு கணக்குத் தேவைதா?',
    'rememberMe'         => 'எனக்கு நினைவில் வையா?',
    'forgotPassword'     => 'கடவுச்சொல்லை மறந்துவிட்டீர்களா?',
    'useMagicLink'       => 'ஒரு உள்நுழைவு இணைப்பைப் பயன்படுத்தவும்',
    'magicLinkSubject'   => 'உங்கள் உள்நுழைவு இணைப்பு',
    'magicTokenNotFound' => 'இணைப்பைச் சரிபார்க்க முடியவில்லை.',
    'magicLinkExpired'   => 'மன்னிக்கவும், இணைப்பு காலாவதியானது.',
    'checkYourEmail'     => 'உங்கள் மின்னஞ்சலைச் சரிபார்க்கவும்!',
    'magicLinkDetails'   => 'நாங்கள் உங்களுக்கு ஒரு உள்நுழைவு இணைப்புடன் மின்னஞ்சலை அனுப்பியுள்ளோம். நீங்கள் அதை கண்டுபிடிக்க முடியாவிட்டால், உங்கள் ஸ்பாம்/ஜங்க் கோப்புறையைச் சரிபார்க்கவும். இது {0} நிமிடங்களுக்கு மட்டுமே செல்லுபடியாகும்.',
    'magicLinkDisabled'  => 'MagicLink இன் பயன்பாடு தற்போது அனுமதிக்கப்படவில்லை.',
    'successLogout'      => 'நீங்கள் வெற்றிகரமாக வெளியேறியுள்ளீர்கள்.',
    'backToLogin'        => 'உள்நுழைய திரும்பவும்',

    // Change password
    'changePassword'            => 'கடவுச்சொல் மாற்றம்',
    'newPassword'               => 'புதிய கடவுச்சொல்',
    'newPasswordConfirm'        => 'புதிய கடவுச்சொல் (மீண்டும்)',
    'changePasswordBtn'         => 'புதுப்பிக்கவும்',
    'changePasswordTime'        => 'நீங்கள் விரும்பினால் புதிய கடவுச்சொல்லுக்கு மாற்றலாம்.',
    'changePasswordSuccess'     => 'புதிய கடவுச்சொல் வெற்றிகரமாக மாற்றப்பட்டுள்ளது.',
    
    // Passwords
    'errorPasswordLength'       => 'கடவுச்சொல் குறைந்தது {0, number} எழுத்துக்களாக இருக்க வேண்டும்.',
    'suggestPasswordLength'     => 'விருப்பவொருட்கள் - 255 எழுத்துக்களுக்குள் - நினைவில் வைராக்கலான பாதுகாப்பான கடவுச்சொற்களை உருவாக்குகிறது.',
    'errorPasswordCommon'       => 'கடவுச்சொல் பொதுவான கடவுச்சொல்லாக இருக்க முடியாது.',
    'suggestPasswordCommon'     => 'கடவுச்சொல் 65k ஆக பொதுவாகப் பயன்படுத்தப்படும் கடவுச்சொற்களை அல்லது ஹேக் மூலம் வெளிக்கொண்ட கடவுச்சொற்களை எதிர்த்துப் பார்க்கப்பட்டது.',
    'errorPasswordPersonal'     => 'கடவுச்சொற்களில் மறுபரிசீலிக்கப்பட்ட தனிப்பட்ட தகவல்களை அடங்காமல் இருக்க வேண்டும்.',
    'suggestPasswordPersonal'   => 'உங்கள் மின்னஞ்சல் முகவரி அல்லது பயனர்பெயர் ஆகியவற்றின் மாறுபாடுகளை கடவுச்சொற்களில் பயன்படுத்தக் கூடாது.',
    'errorPasswordTooSimilar'   => 'கடவுச்சொல் பயனர்பெயருக்கு மிகவும் ஒத்திருக்கிறது.',
    'suggestPasswordTooSimilar' => 'உங்கள் கடவுச்சொல்லில் பயனர்பெயரின் பகுதிகளைப் பயன்படுத்த வேண்டாம்.',
    'errorPasswordPwned'        => 'கடவுச்சொல் {0} தரவுப் புனிதம் காரணமாக வெளிப்படுத்தப்பட்டது மற்றும் {1, number} முறை {2} ஆஃபர் குறைந்திருந்தது.',
    'suggestPasswordPwned'      => '{0} கடவுச்சொல் போலவே பயன்படுத்தக்கூடாது. நீங்கள் இதைப் பயன்படுத்தினால் உடனடியாக மாற்றவும்.',
    'errorPasswordEmpty'        => 'ஒரு கடவுச்சொல் தேவை.',
    'errorPasswordTooLongBytes' => 'கடவுச்சொல் {param} bytes அளவை மிதந்துவிட முடியாது.',
    'passwordChangeSuccess'     => 'கடவுச்சொல் வெற்றிகரமாக மாற்றப்பட்டது',
    'userDoesNotExist'          => 'கடவுச்சொல் மாற்றப்படவில்லை. பயனர் இல்லாதார்',
    'resetTokenExpired'         => 'மன்னிக்கவும். உங்கள் மீட்டமைக்கப்பட்ட token காலாவதியானது.',
    
    // Email Globals
    'emailInfo'      => 'மனிதரின் சில தகவல்கள்:',
    'emailIpAddress' => 'IP முகவரி:',
    'emailDevice'    => 'சாதனம்:',
    'emailDate'      => 'தேதி:',
    
    // 2FA
    'email2FATitle'       => 'இரண்டு காரணி அங்கீகாரம்',
    'confirmEmailAddress' => 'உங்கள் மின்னஞ்சல் முகவரியை உறுதிப்படுத்தவும்.',
    'emailEnterCode'      => 'உங்கள் மின்னஞ்சலை உறுதிப்படுத்தவும்',
    'emailConfirmCode'    => 'உங்கள் மின்னஞ்சல் முகவரிக்கு நாங்கள் அனுப்பிய 6-எண் குறியீட்டை உள்ளிடவும்.',
    'email2FASubject'     => 'உங்கள் அங்கீகாரக் குறியீடு',
    'email2FAMailBody'    => 'உங்கள் அங்கீகாரக் குறியீடு:',
    'invalid2FAToken'     => 'குறியீடு தவறாக உள்ளது.',
    'need2FA'             => 'இரண்டு காரணி சரிபார்ப்பை முடிக்க வேண்டியது அவசியம்.',
    'needVerification'    => 'கணக்கை செயல்படுத்த மின்னஞ்சலைச் சரிபார்க்கவும்.',
    
    // Activate
    'emailActivateTitle'    => 'மின்னஞ்சல் செயலாக்கம்',
    'emailActivateBody'     => 'உங்கள் மின்னஞ்சல் முகவரியை உறுதிப்படுத்த குறியீடு கொண்ட மின்னஞ்சலை நாங்கள் அனுப்பியுள்ளோம். நீங்கள் அதை கண்டுபிடிக்க முடியாவிட்டால், உங்கள் ஸ்பாம்/ஜங்க் கோப்புறையைச் சரிபார்க்கவும். அந்த குறியீட்டை நகலெடுத்து கீழே ஒட்டவும்.',
    'emailActivateSubject'  => 'உங்கள் செயலாக்க குறியீடு',
    'emailActivateMailBody' => 'உங்கள் கணக்கை செயல்படுத்த மற்றும் தளத்தைப் பயன்படுத்தத் தொடங்க கீழே உள்ள குறியீட்டை பயன்படுத்தவும்.',
    'invalidActivateToken'  => 'குறியீடு தவறாக உள்ளது.',
    'needActivate'          => 'உங்கள் மின்னஞ்சல் முகவரிக்கு அனுப்பிய குறியீட்டை உறுதிப்படுத்தி உங்கள் பதிவுசெயலையை முடிக்க வேண்டும்.',
    'activationBlocked'     => 'உள்நுழையும்போது உங்கள் கணக்கை செயல்படுத்த வேண்டும்.',
    
    // Groups
    'unknownGroup' => '{0} ஒரு செல்லுபடியான குழு அல்ல.',
    'missingTitle' => 'குழுக்கள் தலைப்பைப் பெற்றிருக்க வேண்டும்.',
    
    // Permissions
    'unknownPermission' => '{0} ஒரு செல்லுபடியான அனுமதி அல்ல.',
];
