<?php

/**
 * This file is part of CodeIgniter 4 framework.
 *
 * (c) CodeIgniter Foundation <admin@codeigniter.com>
 *
 * For the full copyright and license information, please view
 * the LICENSE file that was distributed with this source code.
 */

// Validation language settings
return [
    // Core Messages
    'noRuleSets'      => 'செகிபார்க்கும் கட்டுப்பாடுகள் குறிப்பிடப்படவில்லை.',
    'ruleNotFound'    => '"{0}" ஒரு செல்லுபடியான கட்டுப்பாடு அல்ல.',
    'groupNotFound'   => '"{0}" ஒரு செகிபார்க்கும் கட்டுப்பாட்டு குழுவல்ல.',
    'groupNotArray'   => '"{0}" கட்டுப்பாட்டு குழு ஒரு அட்டவணையாக இருக்க வேண்டும்.',
    'invalidTemplate' => '"{0}" ஒரு செல்லுபடியான செகிபார்க்கும் மாதிரி அல்ல.',

    'alpha'                 => '{field} புலம் மூலம் மட்டுமே எழுத்துப்பாகங்களை கொண்டிருக்க வேண்டும்.',
    'alpha_dash'            => '{field} புலம் மூலம் மட்டுமே எழுத்துப்பாகங்கள், எண், கீழ்ப்படிவம் மற்றும் dash எழுத்துக்களை கொண்டிருக்க வேண்டும்.',
    'alpha_numeric'         => '{field} புலம் மூலம் மட்டுமே எழுத்துப்பாகங்கள் மற்றும் எண்களை கொண்டிருக்க வேண்டும்.',
    'alpha_numeric_punct'   => '{field} புலம் மூலம் மட்டுமே எழுத்துப்பாகங்கள், இடங்கள், மற்றும் ~ ! # $ % & * - _ + = | : . எழுத்துக்களை கொண்டிருக்கலாம்.',
    'alpha_numeric_space'   => '{field} புலம் மூலம் மட்டுமே எழுத்துப்பாகங்கள் மற்றும் இடங்களை கொண்டிருக்க வேண்டும்.',
    'alpha_space'           => '{field} புலம் மூலம் மட்டுமே எழுத்துப்பாகங்கள் மற்றும் இடங்களை கொண்டிருக்க வேண்டும்.',
    'decimal'               => '{field} புலம் ஒரு அதிர்வெண் கொண்டிருக்க வேண்டும்.',
    'differs'               => '{field} புலம் {param} புலத்தை மாறுபட வேண்டும்.',
    'equals'                => '{field} புலம் துல்லியமாக: {param} இருக்க வேண்டும்.',
    'exact_length'          => '{field} புலம் துல்லியமாக {param} எழுத்துகளாக இருக்க வேண்டும்.',
    'greater_than'          => '{field} புலம் {param} ஐ விட பெரிய எண்ணைக் கொண்டிருக்க வேண்டும்.',
    'greater_than_equal_to' => '{field} புலம் {param} ஐ விட பெரிய அல்லது சமமான எண்ணைக் கொண்டிருக்க வேண்டும்.',
    'hex'                   => '{field} புலம் hexadecimal எழுத்துக்களை மட்டுமே கொண்டிருக்க வேண்டும்.',
    'in_list'               => '{field} புலம்: {param} இல் ஒன்றாக இருக்க வேண்டும்.',
    'integer'               => '{field} புலம் முழு எண்ணைக் கொண்டிருக்க வேண்டும்.',
    'is_natural'            => '{field} புலம் எண்களை மட்டுமே கொண்டிருக்க வேண்டும்.',
    'is_natural_no_zero'    => '{field} புலம் எண்களை மட்டுமே கொண்டிருக்க வேண்டும் மற்றும் அது பூஜ்யத்துக்கு மேல் இருக்க வேண்டும்.',
    'is_not_unique'         => '{field} புலம் தரவுத்தொகுப்பில் முந்தைய மூலமாக இருக்க வேண்டும்.',
    'is_unique'             => '{field} புலம் ஒரு தனிப்பட்ட மதிப்பைக் கொண்டிருக்க வேண்டும்.',
    'less_than'             => '{field} புலம் {param} ஐ விட சிறிய எண்ணைக் கொண்டிருக்க வேண்டும்.',
    'less_than_equal_to'    => '{field} புலம் {param} ஐ விட சிறிய அல்லது சமமான எண்ணைக் கொண்டிருக்க வேண்டும்.',
    'matches'               => '{field} புலம் {param} புலத்தை ஒத்து விடவில்லை.',
    'max_length'            => '{field} புலம் {param} எழுத்துக்களை முந்திக்கொள்ளக் கூடாது.',
    'min_length'            => '{field} புலம் குறைந்தது {param} எழுத்துக்களை கொண்டிருக்க வேண்டும்.',
    'not_equals'            => '{field} புலம்: {param} இல்லை.',
    'not_in_list'           => '{field} புலம்: {param} இல் ஒன்றாக இருக்க கூடாது.',
    'numeric'               => '{field} புலம் எண்களை மட்டுமே கொண்டிருக்க வேண்டும்.',
    'regex_match'           => '{field} புலம் சரியான வடிவத்தில் இல்லை.',
    'required'              => '{field} புலம் தேவை.',
    'required_with'         => '{field} புலம் {param} முன்னிலையில் தேவை.',
    'required_without'      => '{field} புலம் {param} இல்லாத போது தேவை.',
    'string'                => '{field} புலம் சரியான சரம் ஆக இருக்க வேண்டும்.',
    'timezone'              => '{field} புலம் சரியான நேர மண்டலமாக இருக்க வேண்டும்.',
    'valid_base64'          => '{field} புலம் சரியான base64 சரம் ஆக இருக்க வேண்டும்.',
    'valid_email'           => '{field} புலம் சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்.',
    'valid_emails'          => '{field} புலம் அனைத்து சரியான மின்னஞ்சல் முகவரிகளை கொண்டிருக்க வேண்டும்.',
    'valid_ip'              => '{field} புலம் சரியான IP ஆக இருக்க வேண்டும்.',
    'valid_url'             => '{field} புலம் சரியான URL ஆக இருக்க வேண்டும்.',
    'valid_url_strict'      => '{field} புலம் சரியான URL ஆக இருக்க வேண்டும்.',
    'valid_date'            => '{field} புலம் சரியான தேதி ஆக இருக்க வேண்டும்.',
    'valid_json'            => '{field} புலம் சரியான json ஆக இருக்க வேண்டும்.',

    'valid_cc_num' => '{field} ஒரு செல்லுபடியான கிரெடிட் கார்ட் எண் போல தோன்றவில்லை.',

    'uploaded' => '{field} ஒரு செல்லுபடியான பதிவேற்றப்பட்ட கோப்பு அல்ல.',
    'max_size' => '{field} கோப்பு மிகுந்த அளவானது.',
    'is_image' => '{field} ஒரு செல்லுபடியான, பதிவேற்றப்பட்ட படப் கோப்பு அல்ல.',
    'mime_in'  => '{field} ஒரு செல்லுபடியான mime வகை இல்லை.',
    'ext_in'   => '{field} ஒரு செல்லுபடியான கோப்பு நீளம் இல்லை.',
    'max_dims' => '{field} ஒரு படம் அல்ல, அல்லது அது மிக நீளம் அல்லது உயரமாக இருக்கிறது.',
];
